//тип + массив/объект, экспорт по именам

/* Например: Москва, Санкт-Петербург, Новосибирск, Екатеринбург, Казань, 
Нижний Новгород, Челябинск, Самара, Омск, Ростов-на-Дону, Уфа, 
Красноярск, Пермь, Воронеж, ВолгоградНапример: Москва, Санкт-Петербург, 
Новосибирск, Екатеринбург, Казань, Нижний Новгород, Челябинск, Самара, 
Омск, Ростов-на-Дону, Уфа, Красноярск, Пермь, Воронеж, Волгоград */

import type { Option } from '@shared/types';

export const CITIES: Option[] = [
  { value: '1', label: 'Москва' },
  { value: '2', label: 'Санкт‑Петербург' },
  { value: '3', label: 'Новосибирск' },
  { value: '4', label: 'Екатеринбург' },
  { value: '5', label: 'Казань' },
  { value: '6', label: 'Нижний Новгород' },
  { value: '7', label: 'Челябинск' },
  { value: '8', label: 'Самара' },
  { value: '9', label: 'Омск' },
  { value: '10', label: 'Ростов‑на‑Дону' },
  { value: '11', label: 'Уфа' },
  { value: '12', label: 'Красноярск' },
  { value: '13', label: 'Пермь' },
  { value: '14', label: 'Воронеж' },
  { value: '15', label: 'Волгоград' },
] as const;

export type TCity = (typeof CITIES)[number];
